In [1]:
import numpy as np
import pandas as pd

In [22]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [3]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [4]:
np.unique(df['col2'])

array([444, 555, 666], dtype=int64)

In [5]:
df['col2'].nunique() # Mostra a quantidade de valores

3

In [6]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [7]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [9]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [11]:
def vezes2(x):
    return x*2

In [13]:
df['col1']

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [14]:
df['col1'].apply(vezes2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [15]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [17]:
df['col1'].apply(lambda x: x*2) # Não polui o codigo pois não precisa definir a função

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [18]:
del df['col2'] # Deleta a coluna 2 (metodo padrao do Python)

In [19]:
df

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [20]:
df.columns

Index(['col1', 'col3'], dtype='object')

In [21]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [23]:
df.sort_values(by='col2') # Ordena pela coluna especificada - inplace padrão é false

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [24]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [25]:
df.sort_values(by='col2', inplace=True)

In [26]:
df

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [28]:
df.isnull() # Retorna com True todos os valores NULL

    col1   col2   col3
0  False  False  False
3  False  False  False
1  False  False  False
2  False  False  False

In [29]:
df.dropna() # Deleta as linhas ou colunas com valor NULL (axis 0 = linha | axis 1 = coluna)

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [30]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [33]:
df['col1'].fillna(value=df['col1'].mean())

0    1.0
1    2.0
2    3.0
3    2.0
Name: col1, dtype: float64

In [34]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [35]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [36]:
df.pivot_table(values='D', index=['A', 'B'], columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN